QA/tests/advanced/load-1000.yaml
# PharmaQuick - Test de Carga 1000 Peticiones (5000 usuarios virtuales max)
# Test conservador con ramp-up gradual

config:
  target: "http://localhost:8080"
  phases:
    # Fase 1: Warm-up muy gradual (1 min) - 5 a 30 usuarios
    - name: "Warm-up Ligero"
      duration: 60
      arrivalRate: 5
      rampTo: 30

    # Fase 2: Carga progresiva (1.5 min) - 30 a 100 usuarios
    - name: "Carga Progresiva"
      duration: 90
      arrivalRate: 30
      rampTo: 100

    # Fase 3: Pico moderado (1.5 min) - 100 a 200 usuarios
    - name: "Pico Moderado"
      duration: 90
      arrivalRate: 100
      rampTo: 200

    # Fase 4: Sostención (1 min) - Mantener ~150 usuarios
    - name: "Carga Sostenida"
      duration: 60
      arrivalRate: 150

    # Fase 5: Enfriamiento (30 seg)
    - name: "Enfriamiento"
      duration: 30
      arrivalRate: 150
      rampTo: 10

  # Datos de usuarios
  payload:
    path: "data/usuarios.csv"
    fields:
      - "email"
      - "password"
      - "nombre"
      - "rol"
    order: "random"
    skipHeader: true

  ensure:
    thresholds:
      - http.response_time.p95: 1500
      - http.response_time.p99: 3000
      - http.codes.500: "< 3%"
    conditions:
      - expression: "http.codes.200 > 100"
        strict: false

  # Configuración de engine
  http2: false
  timeout: 30

scenarios:
  # Escenario 1: Usuario autenticado - CRUD completo (35%)
  - name: "Usuario Autenticado - CRUD"
    weight: 35
    flow:
      # Login
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
          capture:
            - json: "$.data.token"
              as: "jwtToken"
          expect:
            - statusCode: 200

      - think: 1

      # Obtener perfil
      - get:
          url: "/api/perfil"
          headers:
            Authorization: "Bearer {{ jwtToken }}"
          expect:
            - statusCode: 200

      - think: 1

      # Listar productos
      - get:
          url: "/api/productos"
          headers:
            Authorization: "Bearer {{ jwtToken }}"
          expect:
            - statusCode: 200

      - think: 1

      # Ver categorías
      - get:
          url: "/api/productos/categorias"
          headers:
            Authorization: "Bearer {{ jwtToken }}"
          expect:
            - statusCode: 200

  # Escenario 2: Inventario (30%)
  - name: "Operaciones de Inventario"
    weight: 30
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
          capture:
            - json: "$.data.token"
              as: "jwtToken"
          expect:
            - statusCode: 200

      - think: 1

      # Ver resumen inventario
      - get:
          url: "/api/inventario/resumen"
          headers:
            Authorization: "Bearer {{ jwtToken }}"
          expect:
            - statusCode: 200

      - think: 1

      # Ver alertas
      - get:
          url: "/api/inventario/alertas"
          headers:
            Authorization: "Bearer {{ jwtToken }}"
          expect:
            - statusCode: 200

      - think: 1

      # Ver lotes
      - get:
          url: "/api/lotes"
          headers:
            Authorization: "Bearer {{ jwtToken }}"
          expect:
            - statusCode: 200

  # Escenario 3: Búsqueda y productos (25%)
  - name: "Búsqueda de Productos"
    weight: 25
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
          capture:
            - json: "$.data.token"
              as: "jwtToken"
          expect:
            - statusCode: 200

      - think: 1

      # Buscar productos
      - get:
          url: "/api/productos/search?q=para"
          headers:
            Authorization: "Bearer {{ jwtToken }}"
          expect:
            - statusCode: 200

      - think: 1

      # Ver inventario FEFO
      - get:
          url: "/api/inventario/fefo"
          headers:
            Authorization: "Bearer {{ jwtToken }}"
          expect:
            - statusCode: 200

  # Escenario 4: Ventas y reservas (10%)
  - name: "Ventas y Reservas"
    weight: 10
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
          capture:
            - json: "$.data.token"
              as: "jwtToken"
          expect:
            - statusCode: 200

      - think: 1

      # Ver ventas
      - get:
          url: "/api/ventas"
          headers:
            Authorization: "Bearer {{ jwtToken }}"
          expect:
            - statusCode: 200

      - think: 1

      # Ver reservas
      - get:
          url: "/api/reservas"
          headers:
            Authorization: "Bearer {{ jwtToken }}"
          expect:
            - statusCode: 200